CRUD/controllers/SiteController.php

    public function actionIndex()
    {
        $data = Data::find()->all();
---
SELECT * FROM `data`

    public function actionCreate(){
        $post= new Data();
        $formData= Yii::$app->request->post();
        if($post->load($formData)){
            if($post->save()){
---
INSERT INTO `data` (`Name`, `Remarks`, `Class`) VALUES ('Ravi', 'Poor', '3rd Standard')

    public function actionRead($Id){
        $post= Data::findOne($Id);
---
SELECT * FROM `data` WHERE `Id`='5'

    public function actionUpdate($Id){
        $post= Data::findOne($Id);
        if($post->load(Yii::$app->request->post()) && $post->save()){
---
SELECT * FROM `data` WHERE `Id`='7'
UPDATE `data` SET `Class`='7th Standard' WHERE `Id`=2

    public function actionDelete($Id){
        $post= Data::findOne($Id)->delete();
---
DELETE FROM `data` WHERE `Id`=4
SELECT * FROM `data` WHERE `Id`='4'